{"name":"chess_model","layers":[{"name":"input_1","class_name":"InputLayer","config":{"batch_input_shape":[null,18,8,8],"dtype":"float32","sparse":false,"name":"input_1"},"inbound_nodes":[]},{"name":"input_conv-3-256","class_name":"Conv2D","config":{"name":"input_conv-3-256","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["input_1",0,0,{}]]]},{"name":"input_batchnorm","class_name":"BatchNormalization","config":{"name":"input_batchnorm","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["input_conv-3-256",0,0,{}]]]},{"name":"input_relu","class_name":"Activation","config":{"name":"input_relu","trainable":true,"activation":"relu"},"inbound_nodes":[[["input_batchnorm",0,0,{}]]]},{"name":"res1_conv1-3-256","class_name":"Conv2D","config":{"name":"res1_conv1-3-256","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["input_relu",0,0,{}]]]},{"name":"res1_batchnorm1","class_name":"BatchNormalization","config":{"name":"res1_batchnorm1","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["res1_conv1-3-256",0,0,{}]]]},{"name":"res1_relu1","class_name":"Activation","config":{"name":"res1_relu1","trainable":true,"activation":"relu"},"inbound_nodes":[[["res1_batchnorm1",0,0,{}]]]},{"name":"res1_conv2-3-256","class_name":"Conv2D","config":{"name":"res1_conv2-3-256","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["res1_relu1",0,0,{}]]]},{"name":"res1_batchnorm2","class_name":"BatchNormalization","config":{"name":"res1_batchnorm2","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["res1_conv2-3-256",0,0,{}]]]},{"name":"res1_add","class_name":"Add","config":{"name":"res1_add","trainable":true},"inbound_nodes":[[["input_relu",0,0,{}],["res1_batchnorm2",0,0,{}]]]},{"name":"res1_relu2","class_name":"Activation","config":{"name":"res1_relu2","trainable":true,"activation":"relu"},"inbound_nodes":[[["res1_add",0,0,{}]]]},{"name":"res2_conv1-3-256","class_name":"Conv2D","config":{"name":"res2_conv1-3-256","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["res1_relu2",0,0,{}]]]},{"name":"res2_batchnorm1","class_name":"BatchNormalization","config":{"name":"res2_batchnorm1","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["res2_conv1-3-256",0,0,{}]]]},{"name":"res2_relu1","class_name":"Activation","config":{"name":"res2_relu1","trainable":true,"activation":"relu"},"inbound_nodes":[[["res2_batchnorm1",0,0,{}]]]},{"name":"res2_conv2-3-256","class_name":"Conv2D","config":{"name":"res2_conv2-3-256","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["res2_relu1",0,0,{}]]]},{"name":"res2_batchnorm2","class_name":"BatchNormalization","config":{"name":"res2_batchnorm2","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["res2_conv2-3-256",0,0,{}]]]},{"name":"res2_add","class_name":"Add","config":{"name":"res2_add","trainable":true},"inbound_nodes":[[["res1_relu2",0,0,{}],["res2_batchnorm2",0,0,{}]]]},{"name":"res2_relu2","class_name":"Activation","config":{"name":"res2_relu2","trainable":true,"activation":"relu"},"inbound_nodes":[[["res2_add",0,0,{}]]]},{"name":"res3_conv1-3-256","class_name":"Conv2D","config":{"name":"res3_conv1-3-256","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["res2_relu2",0,0,{}]]]},{"name":"res3_batchnorm1","class_name":"BatchNormalization","config":{"name":"res3_batchnorm1","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["res3_conv1-3-256",0,0,{}]]]},{"name":"res3_relu1","class_name":"Activation","config":{"name":"res3_relu1","trainable":true,"activation":"relu"},"inbound_nodes":[[["res3_batchnorm1",0,0,{}]]]},{"name":"res3_conv2-3-256","class_name":"Conv2D","config":{"name":"res3_conv2-3-256","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["res3_relu1",0,0,{}]]]},{"name":"res3_batchnorm2","class_name":"BatchNormalization","config":{"name":"res3_batchnorm2","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["res3_conv2-3-256",0,0,{}]]]},{"name":"res3_add","class_name":"Add","config":{"name":"res3_add","trainable":true},"inbound_nodes":[[["res2_relu2",0,0,{}],["res3_batchnorm2",0,0,{}]]]},{"name":"res3_relu2","class_name":"Activation","config":{"name":"res3_relu2","trainable":true,"activation":"relu"},"inbound_nodes":[[["res3_add",0,0,{}]]]},{"name":"res4_conv1-3-256","class_name":"Conv2D","config":{"name":"res4_conv1-3-256","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["res3_relu2",0,0,{}]]]},{"name":"res4_batchnorm1","class_name":"BatchNormalization","config":{"name":"res4_batchnorm1","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["res4_conv1-3-256",0,0,{}]]]},{"name":"res4_relu1","class_name":"Activation","config":{"name":"res4_relu1","trainable":true,"activation":"relu"},"inbound_nodes":[[["res4_batchnorm1",0,0,{}]]]},{"name":"res4_conv2-3-256","class_name":"Conv2D","config":{"name":"res4_conv2-3-256","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["res4_relu1",0,0,{}]]]},{"name":"res4_batchnorm2","class_name":"BatchNormalization","config":{"name":"res4_batchnorm2","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["res4_conv2-3-256",0,0,{}]]]},{"name":"res4_add","class_name":"Add","config":{"name":"res4_add","trainable":true},"inbound_nodes":[[["res3_relu2",0,0,{}],["res4_batchnorm2",0,0,{}]]]},{"name":"res4_relu2","class_name":"Activation","config":{"name":"res4_relu2","trainable":true,"activation":"relu"},"inbound_nodes":[[["res4_add",0,0,{}]]]},{"name":"res5_conv1-3-256","class_name":"Conv2D","config":{"name":"res5_conv1-3-256","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["res4_relu2",0,0,{}]]]},{"name":"res5_batchnorm1","class_name":"BatchNormalization","config":{"name":"res5_batchnorm1","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["res5_conv1-3-256",0,0,{}]]]},{"name":"res5_relu1","class_name":"Activation","config":{"name":"res5_relu1","trainable":true,"activation":"relu"},"inbound_nodes":[[["res5_batchnorm1",0,0,{}]]]},{"name":"res5_conv2-3-256","class_name":"Conv2D","config":{"name":"res5_conv2-3-256","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["res5_relu1",0,0,{}]]]},{"name":"res5_batchnorm2","class_name":"BatchNormalization","config":{"name":"res5_batchnorm2","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["res5_conv2-3-256",0,0,{}]]]},{"name":"res5_add","class_name":"Add","config":{"name":"res5_add","trainable":true},"inbound_nodes":[[["res4_relu2",0,0,{}],["res5_batchnorm2",0,0,{}]]]},{"name":"res5_relu2","class_name":"Activation","config":{"name":"res5_relu2","trainable":true,"activation":"relu"},"inbound_nodes":[[["res5_add",0,0,{}]]]},{"name":"res6_conv1-3-256","class_name":"Conv2D","config":{"name":"res6_conv1-3-256","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["res5_relu2",0,0,{}]]]},{"name":"res6_batchnorm1","class_name":"BatchNormalization","config":{"name":"res6_batchnorm1","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["res6_conv1-3-256",0,0,{}]]]},{"name":"res6_relu1","class_name":"Activation","config":{"name":"res6_relu1","trainable":true,"activation":"relu"},"inbound_nodes":[[["res6_batchnorm1",0,0,{}]]]},{"name":"res6_conv2-3-256","class_name":"Conv2D","config":{"name":"res6_conv2-3-256","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["res6_relu1",0,0,{}]]]},{"name":"res6_batchnorm2","class_name":"BatchNormalization","config":{"name":"res6_batchnorm2","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["res6_conv2-3-256",0,0,{}]]]},{"name":"res6_add","class_name":"Add","config":{"name":"res6_add","trainable":true},"inbound_nodes":[[["res5_relu2",0,0,{}],["res6_batchnorm2",0,0,{}]]]},{"name":"res6_relu2","class_name":"Activation","config":{"name":"res6_relu2","trainable":true,"activation":"relu"},"inbound_nodes":[[["res6_add",0,0,{}]]]},{"name":"res7_conv1-3-256","class_name":"Conv2D","config":{"name":"res7_conv1-3-256","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["res6_relu2",0,0,{}]]]},{"name":"res7_batchnorm1","class_name":"BatchNormalization","config":{"name":"res7_batchnorm1","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["res7_conv1-3-256",0,0,{}]]]},{"name":"res7_relu1","class_name":"Activation","config":{"name":"res7_relu1","trainable":true,"activation":"relu"},"inbound_nodes":[[["res7_batchnorm1",0,0,{}]]]},{"name":"res7_conv2-3-256","class_name":"Conv2D","config":{"name":"res7_conv2-3-256","trainable":true,"filters":256,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["res7_relu1",0,0,{}]]]},{"name":"res7_batchnorm2","class_name":"BatchNormalization","config":{"name":"res7_batchnorm2","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["res7_conv2-3-256",0,0,{}]]]},{"name":"res7_add","class_name":"Add","config":{"name":"res7_add","trainable":true},"inbound_nodes":[[["res6_relu2",0,0,{}],["res7_batchnorm2",0,0,{}]]]},{"name":"res7_relu2","class_name":"Activation","config":{"name":"res7_relu2","trainable":true,"activation":"relu"},"inbound_nodes":[[["res7_add",0,0,{}]]]},{"name":"value_conv-1-1","class_name":"Conv2D","config":{"name":"value_conv-1-1","trainable":true,"filters":1,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["res7_relu2",0,0,{}]]]},{"name":"policy_conv-1-2","class_name":"Conv2D","config":{"name":"policy_conv-1-2","trainable":true,"filters":2,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["res7_relu2",0,0,{}]]]},{"name":"value_batchnorm","class_name":"BatchNormalization","config":{"name":"value_batchnorm","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["value_conv-1-1",0,0,{}]]]},{"name":"policy_batchnorm","class_name":"BatchNormalization","config":{"name":"policy_batchnorm","trainable":true,"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["policy_conv-1-2",0,0,{}]]]},{"name":"value_relu","class_name":"Activation","config":{"name":"value_relu","trainable":true,"activation":"relu"},"inbound_nodes":[[["value_batchnorm",0,0,{}]]]},{"name":"policy_relu","class_name":"Activation","config":{"name":"policy_relu","trainable":true,"activation":"relu"},"inbound_nodes":[[["policy_batchnorm",0,0,{}]]]},{"name":"value_flatten","class_name":"Flatten","config":{"name":"value_flatten","trainable":true},"inbound_nodes":[[["value_relu",0,0,{}]]]},{"name":"policy_flatten","class_name":"Flatten","config":{"name":"policy_flatten","trainable":true},"inbound_nodes":[[["policy_relu",0,0,{}]]]},{"name":"value_dense","class_name":"Dense","config":{"name":"value_dense","trainable":true,"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["value_flatten",0,0,{}]]]},{"name":"policy_out","class_name":"Dense","config":{"name":"policy_out","trainable":true,"units":1968,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["policy_flatten",0,0,{}]]]},{"name":"value_out","class_name":"Dense","config":{"name":"value_out","trainable":true,"units":1,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0.0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["value_dense",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["policy_out",0,0],["value_out",0,0]]}